---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarCurvesData Properties
RebarCurvesData Class See Also Send Feedback
---

The RebarCurvesData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace